from  Ashare import *
    
# 证券代码兼容多种格式 通达信，同花顺，聚宽
# sh000001 (000001.XSHG)    sz399006 (399006.XSHE)   sh600519 ( 600519.XSHG ) 

df=get_price('sh000001',frequency='1d',count=5)      #默认获取今天往前5天的日线实时行情
print('上证指数日线行情\n',df)

df=get_price('000001.XSHG',frequency='1d',count=5,end_date='2021-04-30')  #可以指定结束日期，获取历史行情
print('上证指数历史行情\n',df)                        

df=get_price('000001.XSHG',frequency='1w',count=5,end_date='2018-06-15')  #支持'1d'日, '1w'周,  '1M'月  
print('上证指数历史周线\n',df) 

df=get_price('sh600519',frequency='15m',count=5)     #分钟线实时行情，可用'1m','5m','15m','30m','60m'
print('贵州茅台15分钟线\n',df)

# 贵州茅台60分钟线
# #                          open     high      low    close    volume
                                                                 
# # 2024-01-05 14:00:00  1670.07  1673.80  1661.90  1661.99  277600.0
# # 2024-01-05 15:00:00  1661.88  1666.39  1652.11  1663.36  649516.0
# # 2024-01-08 10:30:00  1661.00  1662.00  1640.01  1640.09  979475.0
# # 2024-01-08 11:30:00  1640.10  1647.77  1640.01  1647.54  418855.0
# # 2024-01-08 14:00:00  1647.53  1647.59  1640.01  1642.07  377175.0
# # 2024-01-08 15:00:00  1642.11  1647.30  1640.77  1643.99  783115.0
df=get_price('600519.XSHG',frequency='60m',count=6)  #分钟线实时行情，可用'1m','5m','15m','30m','60m'
print('贵州茅台60分钟线\n',df)